 var places = [ //Базочка данных для городов в поиске
    'уфа',
    'салават',
    'стерлитамак',
    'ишимбай',
    'мелеуз',
    'кумертау',
    'октябрьский',
    'туймазы',
    'нефтекамск',
    'белорецк',
    'никифарово',
    'благовещенск',
    'белебей',
    'сибай',
    'межгорье',
    'давлеканово',
    'учалы',
    'бирск',
    'дюртюли',
    'агидель',
    'иглино',
    'баймак',
    'чишмы',
    'бурибай',
    'верхнеяркеево',
    'янаул',
    'кананикольское',
];

var savedCenter = [ //Каждый город - свои координаты
  ol.proj.fromLonLat([55.9720554, 54.7387621]), //Уфа
  ol.proj.fromLonLat([55.92594719, 53.3860437]), //Салават
  ol.proj.fromLonLat([55.94389309, 53.6554353]), //Стерлитамак
  ol.proj.fromLonLat([56.0507671, 53.42635809]), //Ишимбай
  ol.proj.fromLonLat([55.9358646, 52.9622477]), //Мелеуз
  ol.proj.fromLonLat([55.8115682, 52.7637387]), //Кумертау
  ol.proj.fromLonLat([53.4895394, 54.4772015]), //Октябрьский
  ol.proj.fromLonLat([53.6921837, 54.5985340]), //Туймазы
  ol.proj.fromLonLat([54.2867394, 56.1026081]), //Нефтекамск
  ol.proj.fromLonLat([58.4060639, 53.9673992]), //Белорецк
  ol.proj.fromLonLat([54.695850, 53.8260254]), //Никифарово
  ol.proj.fromLonLat([55.986122, 55.038554]), //Благовещенск
  ol.proj.fromLonLat([54.1103461, 54.104626]), //Белебей
  ol.proj.fromLonLat([58.672813, 52.720033]),//Сибай
  ol.proj.fromLonLat([57.816590, 54.049803 ]),//Межгорье
  ol.proj.fromLonLat([55.025961, 54.214010 ]),//Давлеканово
  ol.proj.fromLonLat([59.392028, 54.312525 ]),//Учалы
  ol.proj.fromLonLat([55.541196, 55.427388 ]),//Бирск
  ol.proj.fromLonLat([54.862656, 55.478765 ]),//Дюртюли
  ol.proj.fromLonLat([53.934129, 55.898841 ]),//Агидель
  ol.proj.fromLonLat([56.394737, 54.817322 ]),//Иглино
  ol.proj.fromLonLat([58.318205, 52.586019 ]),//Баймак
  ol.proj.fromLonLat([55.377318, 54.591487 ]),//Чишмы
  ol.proj.fromLonLat([58.171394, 51.968889 ]),//Бурибай
  ol.proj.fromLonLat([54.307055, 55.450917 ]),//Верхнеяркеево
  ol.proj.fromLonLat([54.929233, 56.268116 ]),//Янаул
  ol.proj.fromLonLat([57.485036, 52.784183 ]),//Кананикольское
];
