 var places = [ //Базочка данных для городов в поиске
    'уфа',
    'салават',
    'стерлитамак',
    'ишимбай',
    'мелеуз',
    'кумертау',
    'октябрьский',
    'туймазы',
    'нефтекамск',
    'белорецк',
    'никифарово',
    'благовещенск',
    'белебей',
];

var savedCenter = [ //Каждый город - свои координаты
  ol.proj.fromLonLat([55.9720554, 54.7387621]), //Уфа
  ol.proj.fromLonLat([55.92594719, 53.3860437]), //Салават
  ol.proj.fromLonLat([55.94389309, 53.6554353]), //Стерлитамак
  ol.proj.fromLonLat([56.0507671, 53.42635809]), //Ишимбай
  ol.proj.fromLonLat([55.9358646, 52.9622477]), //Мелеуз
  ol.proj.fromLonLat([55.8115682, 52.7637387]), //Кумертау
  ol.proj.fromLonLat([53.4895394, 54.4772015]), //Октябрьский
  ol.proj.fromLonLat([53.6921837, 54.5985340]), //Туймазы
  ol.proj.fromLonLat([54.2867394, 56.1026081]), //Нефтекамск
  ol.proj.fromLonLat([58.4060639, 53.9673992]), //Белорецк
  ol.proj.fromLonLat([54.695850, 53.8260254]), //Никифарово
  ol.proj.fromLonLat([55.986122, 55.038554]), //Благовещенск
  ol.proj.fromLonLat([54.1103461, 54.104626]), //Белебей
];
